class Article {
  String image;
  String title;
  String description;
  String category;

  Article({
    this.image,
    this.title,
    this.description,
    this.category,
  });
}

final List<Article> trendingNews = [
  Article(
    category: 'SU toDay',
    title: 'เป็นบัณฑิต สมสง่าศิลปากร',
    description: '\t\t\t แอดมินในนามตัวแทนของ SU Today และชาวศิลปากรทุกคน ของแสดงความยินดีกับดุษฎีบัณฑิต มหาบัณฑิต และบัณฑิตทุกท่านในโอกาสจบการศึกษาและเข้าพิธีรับพระราชทานปริญญาบัตร มหาวิทยาลัยศิลปากร ประจำปีการศึกษา 2562 วันที่ 30 พฤศจิกายน 2563 \n'
        + '\t\tในความพากเพียรตลอดการศึกษา ได้งอกเงยเป็นความรู้และประสบการณ์ ใบปริญญาบัตรคือหลักฐานของความพยายามนั้น เราภาคภูมิและเป็นเกียรติเสมอ \n'
        + '\t\tระยะเวลาที่ใช้ชีวิตที่ศิลปากร ไม่ว่าจะส่วนงานใด แอดมินเชื่อเหลือเกินว่า กลิ่นอายของศิลปากรจะยังคงหอมหวนติดกายไม่มีวันจาง ขอให้มีความสุขทุกคนครับ \n\n'
        + '\t\tขอบพระคุณภาพจาก เพจ คณะศึกษาศาสตร์ มหาวิทยาลัยศิลปากร \n',

    image: 'assets/images/3.jpg',

  ),
  Article(
    category: 'สำนักดิจิทัลเทคโนโลยี ศิลปากร',
    title: 'ขอแจ้งเปิดให้บริการตามมาตรการเว้นระยะห่างทางสังคม',
    description:
    '\t\t\tสำนักดิจิทัลเทคโนโลยี มหาวิทยาลัยศิลปากร ขอแจ้งเปิดให้บริการตามมาตรการเว้นระยะห่างทางสังคม เคาน์เตอร์เซอร์วิส, บริการห้อง Free lab, print service ตั้งแต่วันที่ 1 กุมภาพันธ์ 2564 เป็นต้นไป ในเวลาราชการ (จันทร์-ศุกร์ เวลา 8.30-16.30 น.) จนกว่าจะมีสถานการณ์การแพร่ระบาดที่เปลี่ยนแปลง มหาวิทยาลัยได้ประกาศกำหนดแนวทางดำเนินการต่อไป\n\n'
        '\t\t\tช่องทางการติดต่อ : โทรศัพท์ 08 1995 6301 (ในเวลาราชการ) หรือ\n'
        '\t\t\tแจ้งฝากข้อความผ่าน Facebook : สำนักดิจิทัลเทคโนโลยี มหาวิทยาลัยศิลปากร ได้ตลอดเวลา\n',

    image: 'assets/images/2.png',

  ),
  Article(
    category: 'STEP',
    title: 'กำหนดการทดสอบวัดสมิทธิภาพทางภาษาอังกฤษ STEP (เปลี่ยนแปลงจากเดิมวันที่ 26 ธ.ค.2563)',
    description: '\t\t\tกำหนดการทดสอบวัดสมิทธิภาพทางภาษาอังกฤษ STEP ประจำปีการศึกษา 2563 (เปลี่ยนแปลงจากเดิมวันที่ 26 ธ.ค.2563) รอบก่อนสำเร็จการศึกษา สำหรับนักศึกษา ป.ตรี ชั้นปีที่ 3 ปีการศึกษา 2561',

    image: 'assets/images/1.png',

  ),
];


final List<Article> forYou = [
  Article(
    category: 'กองทุนเงินให้กู้ยืมเพื่อการศึกษา',
    title: 'ข่าวดี!! เรียน e-Learning ฟรี กว่า 15 หลักสูตร นับชั่วโมงจิตสาธารณะ กยศ.',
    description: '\t\tข่าวดี!! เรียน e-Learning นับชั่วโมงจิตสาธารณะ กยศ. หลักสูตรด้านการวางแผนการเงินการลงทุนและด้านความเป็นผู้ประกอบการกว่า 15 หลักสูตร ที่จะทำให้เรียนรู้เทคนิคบริหารเงินอย่างถูกวิธีและพัฒนาทักษะการเป็นผู้ประกอบการ เพื่อเป้าหมายชีวิตในอนาคต\n\n'
      +'หลักสูตรด้านการวางแผน The Series NEW\n'
          +'\t\t1. ชีวิตดี เริ่มต้นที่การวางแผน\n'
          +'\t\t2. เตรียมความพร้อม สู้ทางเลือกอาชีพในฝัน\n'
          +'\t\t3. คัมภีร์ 4 รู้ วางแผนดี ชีวิตมั่นคง\n'
          +'\t\t4. วางแผนสร้างเงินออม เพื่ออนาคต\n'
          +'\t\t5. วางแผนลดหนี้มีออม  เพื่ออนาคต\n'
          +'\t\t6. เงินทองต้องวางแผน\n'
          +'\t\t7. หลักปรัชญาของเศรษฐกิจพอเพียง\n'
          +'\t\t8. หมดหนี้ มีออม\n'
          +'\t\t9. ครบเครื่องเรื่องลงทุน\n'
          +'\t\t10.วางแผนลงทุนสม่ำเสมอด้วยหุ้นและกองทุน\n'
          +'\t\t11. กองทุนรวม The Series\n\n'
      +'หลักสูตรด้านความเป็นผู้ประกอบการ\n'
          +'\t\t1. Entrepreneurial Mindset NEW\n'
          +'\t\t2. Design Thinking NEW\n'
          +'\t\t3. Digital Marketing NEW\n'
          +'\t\t4. Startup Business\n',
    image: 'assets/images/5.webp',

  ),
  Article(
    category: 'สำนักดิจิทัลเทคโนโลยี ศิลปากร',
    title: 'โครงการแจกแพ็กเกจอินเทอร์เน็ต',
    description: '\t\tประกาศ สำหรับท่านที่ลงทะเบียนโครงการแจกแพ็กเกจอินเทอร์เน็ตสำหรับนักศึกษาเพื่อใช้ในการเรียนออนไลน์ (สำหรับคณะวิชาที่เข้าร่วมโครงการจัดซื้อผ่านสำนักดิจิทัลเทคโนโลยี) ต้องกดรับ code แพ็กเกจอินเทอร์เน็ต ภายในวันที่ 25 กุมภาพันธ์ 2564 ผ่านทางเว็บไซต์ portal.su.ac.t',
    image: 'assets/images/4.jpg',

  ),
  Article(
    category: 'คณะกรรมการนักศึกษาประจำหอพัก',
    title: 'Save World Save your Dorm ',
    description: '\t\tเชิญชวนนักศึกษาหอในและหอนอก เข้าร่วมกิจกรรมสร้างสรรค์สื่อประชาสัมพันธ์เกี่ยวกับการอนุรักษ์และประหยัดพลังงาน โดยส่งสื่อประชาสัมพันธ์เข้าร่วมประกวด\n'
    +'รางวัล'
    +  '\t\t- รางวัลชนะเลิศอันดับที่ 1 จะได้รับเงินรางวัลจำนวน 1,000 บาท\n'
    +  '\t\t- รางวัลรองชนะเลิศอันดับที่ 1 จะได้รับเงินรางวัลจำนวน 800 บาท\n'
    +  '\t\t- รางวัลรองชนะเลิศอันดับที่ 2 จะได้รับเงินรางวัลจำนวน 600 บาท\n'
    +  '\t\t- รางวัลชมเชย จะได้รับเงินรางวัลจำนวน 200 บาท จำนวน 7 รางวัล\n\n'
    +  'เกณฑ์การตัดสิน\n'
    +  '\t\t- ความสวยงาม 5 คะแนน\n'
    +  '\t\t- ความคิดสร้างสรรค์ 5 คะแนน\n'
    +  '- สื่อประชาสัมพันธ์ที่ส่งเข้าร่วมไม่จำกัดชนิด ไม่ว่าจะเป็นคลิป VDO หรือโปสเตอร์\n'
    +  '\t\tดำเนินการตัดสินโดยคณะกรรมการนักศึกษาประจำหอพัก มหาวิทยาลัยศิลปากร พระราชวังสนามจันทร์ และ คณะกรรมการนักศึกษาประจำหอพัก จะคัดเลือกสื่อประชาสัมพันธ์ที่ส่งเข้าร่วมกิจกรรมทั้งหมดจำนวน 20 ชิ้น เพื่อทำการตัดสินผู้ชนะโดยวัดจากยอด Like บน Facebook Fanpage “คณะกรรมการนักศึกษาประจำหอพัก มหาวิทยาลัยศิลปากร พระราชวังสนามจันทร์” \n'
    +  '\t\tส่งสื่อประชาสัมพันธ์เข้าร่วมกิจกรรมได้ตั้งแต่ วันนี้ – 22 ก.พ. 2564\n'
    +  '\t\tผู้เข้าร่วมโครงการจะได้รับ 2 คะแนนหอพัก และ 3 ชั่วโมงกิจกรรม (ไม่ใช่ชั่วโมงกิจกรรมจิตอาสา)\n\n'
    +  '*** สื่อประชาสัมพันธ์ทุกชิ้นที่ส่งเข้าประกวดจะถือว่าเป็นลิขสิทธิ์ของคณะกรรมการหอพัก โดยคณะกรรมการหอพักสามารถนำไปทำซ้ำ ดัดแปลงและเผยแพร่ได้ ***\n'
    +  'ลงทะเบียนเข้าร่วมกิจกรรม (ใช้บัญชี @silpakorn.edu ในการดำเนินการเท่านั้น) : https://forms.gle/6sovshqfoAusvf4k6 ',

    image: 'assets/images/save_world.png',

  ),
  Article(
    category: 'G&E Center',
    title: 'ประชาสัมพันธ์เชิญชวนนศ. ป.ตรี เข้าร่วมกิจกรรมพัฒนาภาษาอังกฤษ English for Artists ',
    description:
    '\t\tศูนย์บริหารจัดการวิชาศึกษาทั่วไปฯ (G&E Center) ขอเชิญชวนนักศึกษา ระดับ ป.ตรี ที่มีทักษะภาษาอังกฤษในระดับ A2 เข้าร่วมกิจกรรมพัฒนาภาษาอังกฤษ English for Artists รูปแบบการเรียนการสอนแบบออนไลน์ผ่าน Zoom และ Line โดยอาจารย์ผู้สอนชาวต่างประเทศ (Mr. Rick Grant)\n\n'
        + '\t\tเวลาเรียน : 14.00 - 16.00 น.\n\n'
        + 'เริ่มเรียน\n'
        + '\t\tครั้งที่ 1 วันอังคารที่ 16 ก.พ. 2564\n'
        + '\t\tครั้งที่ 2 วันพฤหัสบดีที่ 18 ก.พ. 2564\n'
        + '\t\tครั้งที่ 3 วันอังคารที่ 23 ก.พ. 2564\n'
        + '\t\tครั้งที่ 4 วันพฤหัสบดีที่ 25 ก.พ. 2564\n'
        + '\t\tครั้งที่ 5 วันอังคารที่ 2 มี.ค. 2564\n\n'
        + 'สามารถสมัครลงทะเบียนรับสิทธิ์ได้จาก QR Code \n'
        + 'ต้องเป็นนักศึกษาระดับ ป.ตรี เท่านั้น (ไม่เสียค่าใช้จ่าย)\n'
        + 'สมัครลงทะเบียนเรียนคอร์สเรียนฯ ได้ตั้งแต่บัดนี้ - 12 ก.พ. 2564\n'
        + 'รับจำนวน 25 คนเท่านั้น หากคอร์สเรียนดังกล่าวเต็มจำนวน ระบบจะปิดรับสมัครอัตโนมัติ\n'
        + 'รายชื่อและช่องทางการเรียนจะประกาศผ่านทาง E-mail ที่นักศึกษาได้สมัครไว้\n',

    image: 'assets/images/English-for-Artistsf.jpg',
  ),
];